projects/smartbands/magic/delivery-magic-wap/app/controllers/wap_controller.rb

SELECT * FROM `stores` WHERE (`stores`.`companies_id` IS NULL) LIMIT 1
SELECT * FROM `addresses` WHERE (`addresses`.`id` = 1) LIMIT 1
---
	def confirm

		@street = purify_address(params["street"])
		@number = params["number"]
		@depto = params["depto"]
		@phone = params["phone"]
		@company = session["companyid"]

		@my_url = 'http://maps.googleapis.com/maps/api/geocode/json?address=' + CGI::escape(@street + " " + @number) + '&sensor=false'
		puts "======================" + @my_url
		uri = URI.parse @my_url
		@res = JSON.parse(Net::HTTP.get_response(uri).body)

		#Show the addresses but only from the countries that have stores
		@possible_countries = Set.new []
		@possible_provinces = Set.new []
		@possible_cities = Set.new []
		@possible_locations = Set.new []
		(Store.find_all_by_companies_id(@company)).each {
		|l|
			addrid = l.addresses_id
			addr = Address.find_by_id(addrid).address

SELECT * FROM `products` WHERE (`products`.`companies_id` = '0')
---

		end

		@products = Product.find_all_by_companies_id(@company)

INSERT INTO `addresses` (`address`, `lng`, `lat`) VALUES('Scalabrini Ortiz Ave 1600, Buenos Aires, Capital Federal, Argentina', -58.4249287, -34.5908501)
INSERT INTO `orders` (`timestamp`, `amount`, `addresses_id`, `phone`, `companies_id`, `depto`, `stores_id`) VALUES('2011-03-17 20:08:41', 42.0, 54, '1540845239', 0, '6e', 12)
---
	def order_product
		@street = params["onestreet"]
		sl = ClosestStoreLocator.new

		if (not @street.nil?)

			@street = purify_address(params["onestreet"])
			@number = params["number"]
			@my_url = 'http://maps.googleapis.com/maps/api/geocode/json?address=' + CGI::escape(@street) + '&sensor=false'

			uri = URI.parse @my_url
			@res = JSON.parse(Net::HTTP.get_response(uri).body)

			session["lat"] = @res["results"][0]["geometry"]["location"]["lat"].to_s
			session["lng"] = @res["results"][0]["geometry"]["location"]["lng"].to_s
			cs = sl.find_closest_store(session["lat"],session["lng"],session["companyid"])

			# Insert order into database

			order_addr = Address.new
			order_addr.lat = session["lat"]
			order_addr.lng = session["lng"]
			order_addr.address = @street
			order_addr.save

SELECT * FROM `products` WHERE (`products`.`companies_id` = '0')
---
			my_order.stores_id = cs
			my_order.save

			products = Product.find_all_by_companies_id(session["companyid"])

SELECT * FROM `products` WHERE (`products`.`name` = 'Empanada Jamon y Queso') LIMIT 1
---
			products.each { |p|
				if (params[p.name.to_s.delete(" ")]!="")
					products_str_for_message = products_str_for_message + "\n" + products_str_for_message + p.name.to_s + ": " + params[p.name.to_s.delete(" ")]
					ordered_product_id = Product.find_by_name(p.name.to_s).id