projects/smartbands/magic/xp/xp-web-ui/xp-web-ui/app/controllers/generated_social_network_controller.rb

  def load_index
    @retrieved_list = User.all
---
SELECT * FROM `users`