projects/smartbands/magic/argenport-webtool/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `address`, `lastname`, `mobile`, `phone`, `accounts_id`, `pic`, `email`) VALUES('Claudio', '64 e/ 115 y 116', 'Carrizo', '0221-155071493', '0221-4244768', NULL, 'https://fbcdn-profile-a.akamaihd.net/hprofile-ak-snc4/275012_1489764421_3654091_n.jpg', 'claudiocarrizo82@hotmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save